import { EquipmentResult } from "./EquipmentApi";

export const EQUIPMNET_MOCK: EquipmentResult = {
    equipment: [
        {
            id: 1,
            name: "автоматичекий аппарат для определения температуры помутнения нефтепродуктов",
            price: 18000,
            description: "Автоматический аппарат АТП-ЛАБ-12 предназначен для определения температуры помутнения нефтепродуктов в строгом соответствии со стандартами DIN EN 23015, ISO 3015, ASTM D2500. Конструкция аппарата и метод проведения анализа полностью выполняет все требования стандартов DIN EN 23015, ISO 3015, ASTM D2500. Аппарат АТП-ЛАБ-12 сочетает в себе последние достижения в области разработки автоматического лабораторного оборудования и выгодно отличается от конкурентов наличием встроенного холодильного модуля, компактными размерами, открытым программным обеспечением и прост в управлении и использовании.",
            image: null
        }, {
            id: 2,
            name: "автоматичекий аппарат для определения температуры помутнения нефтепродуктов",
            price: 18000,
            description: "Автоматический аппарат АТП-ЛАБ-12 предназначен для определения температуры помутнения нефтепродуктов в строгом соответствии со стандартами DIN EN 23015, ISO 3015, ASTM D2500. Конструкция аппарата и метод проведения анализа полностью выполняет все требования стандартов DIN EN 23015, ISO 3015, ASTM D2500. Аппарат АТП-ЛАБ-12 сочетает в себе последние достижения в области разработки автоматического лабораторного оборудования и выгодно отличается от конкурентов наличием встроенного холодильного модуля, компактными размерами, открытым программным обеспечением и прост в управлении и использовании.",
            image: null
        }, {
            id: 11,
            name: "баня водяная четырёхместная",
            price: 8000,
            description: "Водяная баня LOIP LB-140 применима для задач, не требующих высокой точности поддержания температуры. Простая и надежная в эксплуатации модель LOIP LB-140 оснащена цифровым регулятором температуры со светодиодным дисплеем, а также системой защиты от перегрева.",
            image: null
        }
    ],
    procurement_id: -1,
    procurement_count: 1
}